Res-hotel/Res-container-set-v1/container_t_4_c_6_frontCore_4_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  4 threads and 6 connections
  Thread calibration: mean lat.: 3379.620ms, rate sampling interval: 10092ms
  Thread calibration: mean lat.: 2940.199ms, rate sampling interval: 8355ms
  Thread calibration: mean lat.: 4509.696ms, rate sampling interval: 14393ms
  Thread calibration: mean lat.: 4949.158ms, rate sampling interval: 17678ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.38s     5.51s   20.53s    77.62%
    Req/Sec   605.86      4.61   614.00     71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.58s 
 75.000%    9.67s 
 90.000%   19.66s 
 99.000%   20.53s 
 99.900%   20.69s 
 99.990%   20.76s 
 99.999%   20.77s 
100.000%   20.77s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4644.863     0.000000            8         1.00
    5496.831     0.100000        12238         1.11
    5840.895     0.200000        24421         1.25
    6135.807     0.300000        36468         1.43
    6356.991     0.400000        48651         1.67
    6582.271     0.500000        60858         2.00
    6692.863     0.550000        66891         2.22
    6864.895     0.600000        72912         2.50
    7090.175     0.650000        79027         2.86
    7368.703     0.700000        85002         3.33
    9674.751     0.750000        91074         4.00
   14671.871     0.775000        94113         4.44
   18644.991     0.800000        97216         5.00
   18972.671     0.825000       100243         5.71
   19202.047     0.850000       103280         6.67
   19431.423     0.875000       106365         8.00
   19546.111     0.887500       107854         8.89
   19660.799     0.900000       109400        10.00
   19775.487     0.912500       110936        11.43
   19890.175     0.925000       112436        13.33
   20004.863     0.937500       113913        16.00
   20070.399     0.943750       114739        17.78
   20119.551     0.950000       115363        20.00
   20185.087     0.956250       116197        22.86
   20250.623     0.962500       117071        26.67
   20299.775     0.968750       117709        32.00
   20332.543     0.971875       118116        35.56
   20365.311     0.975000       118546        40.00
   20398.079     0.978125       118950        45.71
   20430.847     0.981250       119341        53.33
   20447.231     0.984375       119538        64.00
   20463.615     0.985938       119741        71.11
   20496.383     0.987500       120039        80.00
   20512.767     0.989062       120186        91.43
   20529.151     0.990625       120347       106.67
   20545.535     0.992188       120494       128.00
   20561.919     0.992969       120624       142.22
   20578.303     0.993750       120745       160.00
   20594.687     0.994531       120874       182.86
   20594.687     0.995313       120874       213.33
   20611.071     0.996094       120987       256.00
   20627.455     0.996484       121092       284.44
   20627.455     0.996875       121092       320.00
   20643.839     0.997266       121187       365.71
   20643.839     0.997656       121187       426.67
   20660.223     0.998047       121242       512.00
   20660.223     0.998242       121242       568.89
   20660.223     0.998437       121242       640.00
   20676.607     0.998633       121304       731.43
   20676.607     0.998828       121304       853.33
   20692.991     0.999023       121335      1024.00
   20692.991     0.999121       121335      1137.78
   20709.375     0.999219       121363      1280.00
   20709.375     0.999316       121363      1462.86
   20709.375     0.999414       121363      1706.67
   20725.759     0.999512       121395      2048.00
   20725.759     0.999561       121395      2275.56
   20725.759     0.999609       121395      2560.00
   20725.759     0.999658       121395      2925.71
   20742.143     0.999707       121413      3413.33
   20742.143     0.999756       121413      4096.00
   20742.143     0.999780       121413      4551.11
   20742.143     0.999805       121413      5120.00
   20742.143     0.999829       121413      5851.43
   20758.527     0.999854       121427      6826.67
   20758.527     0.999878       121427      8192.00
   20758.527     0.999890       121427      9102.22
   20758.527     0.999902       121427     10240.00
   20758.527     0.999915       121427     11702.86
   20758.527     0.999927       121427     13653.33
   20758.527     0.999939       121427     16384.00
   20758.527     0.999945       121427     18204.44
   20758.527     0.999951       121427     20480.00
   20758.527     0.999957       121427     23405.71
   20758.527     0.999963       121427     27306.67
   20774.911     0.999969       121431     32768.00
   20774.911     1.000000       121431          inf
#[Mean    =     9382.610, StdDeviation   =     5513.324]
#[Max     =    20758.528, Total count    =       121431]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  145503 requests in 1.00m, 59.99MB read
Requests/sec:   2425.01
Transfer/sec:      1.00MB